app/Models/PanelModel.php

    public function kayit_sil($id)
    {
        $builder = $this->db->table('kayit_ekle');
        $builder->where('id', $id);
        return $builder->delete();
---
DELETE FROM `kayit_ekle`
WHERE `id` = '2'

    public function kayit_al($id)
    {
        $builder = $this->db->table('kayit_ekle');
        $builder->where('id', $id);
        $veri = $builder->get()->getResultArray();
---
SELECT *
FROM `kayit_ekle`
WHERE `id` = '12'

    public function veri_duzenle($baslik, $url, $icerik, $id)
    {
        $builder = $this->db->table('kayit_ekle');
        $builder->where('id', $id);

        $data = [
            'baslik' => $baslik,
            'url' => $url,
            'icerik' => $icerik
        ];
        return $builder->update($data);
---
UPDATE `kayit_ekle` SET `baslik` = 'Selin Doğan', `url` = 'selin_doğan', `icerik` = 'KBB (Kulak Burun Boğaz)\r\nDr. Selin Doğan, Kulak Burun Boğaz uzmanı olarak, işitme bozuklukları, sinüzit, horlama gibi KBB sorunlarına odaklanmıştır. Endoskopik muayene ve modern görüntüleme teknikleri kullanarak hastalarına kesin tanı ve etkili tedavi sunar. Hasta iletişimine önem veren ve tedavi sürecini hastalarıyla birlikte yöneten bir doktordur.'
WHERE `id` = '12'